In [3]:
import pandas as pd
import numpy as np
students = pd.read_csv('D:\Костя\Downloads\StudentsPerformance.csv') #читаем табличку
students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
students.head(10) #первые 10 строчек

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [6]:
students.tail(10) #последние 10 строчек

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [7]:
students.describe() #описательная статистика количественных переменных

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
students.shape #кортеж с кол-вом строк и колонок

(1000, 8)

In [12]:
#integer location
#"срез" DataSeta через указание порядковых номеров строк и столбцов
#первые 5 сторк с первыми 3-мя столбцами
students.iloc[0:5, 0:3]

   gender race/ethnicity         lunch
1  female        group C      standard
3    male        group A  free/reduced
5  female        group B      standard

In [13]:
#можно указывать конкретные строки и конкретные стобцы
students.iloc[[1, 3, 5], [0, 1, 3]]

   gender race/ethnicity         lunch
1  female        group C      standard
3    male        group A  free/reduced
5  female        group B      standard

In [16]:
#индекс в Pandas DataFrame - название строки
students_with_names = students.iloc[0:3]
students_with_names.index = ["Tom", "Bob", "Georg"]
students_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Tom,female,group B,bachelor's degree,standard,none,72,72,74
Bob,female,group C,some college,standard,completed,69,90,88
Georg,female,group B,master's degree,standard,none,90,95,93

In [19]:
#"срез" dataSeta через указание лейблов строк и столбцов
students_with_names.loc[['Tom', 'Bob'], ['math score', 'reading score']]

     math score  reading score
Tom          72             72
Bob          69             90

In [22]:
students_with_names.loc[:, 'math score']

Tom      72
Bob      69
Georg    90
Name: math score, dtype: int64

In [23]:
type(students_with_names.loc[:, 'math score']) #новый тип данных Pandas.Series

pandas.core.series.Series

In [24]:
#одноразмерный массив, хранящий в себе информацию, снабженную лейблами
my_series1 = pd.Series([1, 2, 3], index = ["Tom", "Bob", "Georg"])

Tom      1
Bob      2
Georg    3
dtype: int64

In [4]:
#Pandas DataFrame - это словарик под "ключем" которого (названием стобца) храниться Pandas Series
my_series1 = pd.Series([1, 2, 3], index = ["Tom", "Bob", "Georg"])
my_series2 = pd.Series([4, 5, 6], index = ["Tom", "Bob", "Georg"])
my_df = pd.DataFrame({'score1':my_series1, 'score2':my_series2})

In [35]:
#возвращает серию с описанием типа каждой колонки
students.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [14]:
#Переименование колонок
#inplaxe = True - меняется исходный объект
my_df.rename(columns = {'score1': 'mat', 'score2': 'russian'}, inplace = True)

       mat  russian
Tom      1        4
Bob      2        5
Georg    3        6

In [11]:
#Переименование строк
my_df.rename(index = {'Georg': 'Alex'})

      score1  score2
Tom        1       4
Bob        2       5
Alex       3       6